# homework2.py
# Практическое задание по работе в Pycharm - "Переменные".

# Задаем переменные
completed_tasks = 12           #количество выполненных домашних заданий.
hours_spent = 1.5              #количество затраченных часов.
course_name = 'Python'         #название курса.
time_per_task = hours_spent / completed_tasks   # вычисление времени на одно задание.

# Выводим результат на экран
print("Курс:", course_name, ", всего задач:", completed_tasks, ", затрачено часов:", hours_spent, ", среднее время выполнения", time_per_task, "часа.")  #выводит строку с использованием переменных.
