#homework3.py
#Практическая работа по уроку "Динамическая типизация"

# Создаем переменную name и присваиваем ей значение
name = "Владимир"

# Выводим значение переменной name на экран
print(f"Name: {name}")

# Создаем переменную age и присваиваем ей значение возраста
age = 40  #

# Выводим значение переменной age на экран
print(f"Age: {age}")

# Изменяем значение переменной age на новое значение (например, на age + 1)
age = age + 1

# Выводим измененное значение переменной age на экран
print(f"New Age: {age}")

# Создаем переменную is_student и присваиваем ей значение True
is_student = True

# Выводим значение переменной is_student на экран
print(f"Is Student: {is_student}")